{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi \r",
                "Hello\r",
                "Hey"
            ],
            "responses": [
                "Hello!\r",
                "Good to see you!\r",
                "Hi there, how can I help?"
            ],
            "context_set": ""
        },
        {
            "tag": "farewell",
            "patterns": [
                "Goodbye",
                "Bye",
                "Talk to you later"
            ],
            "responses": [
                "Sad to see you go :(",
                "Goodbye!",
                "Come back soon!"
            ],
            "context_set": ""
        },
        {
            "tag": "creator",
            "patterns": [
                "Who created you?"
            ],
            "responses": [
                "I was created by Saurabh Singh."
            ],
            "context_set": ""
        },
        {
            "tag": "hours",
            "patterns": [
                "What are the college timings?"
            ],
            "responses": [
                "The college is open from 7am to 5pm, Monday to Saturday."
            ],
            "context_set": ""
        },
        {
            "tag": "contact",
            "patterns": [
                "How can I contact the college?",
                "Can I get your contact number?"
            ],
            "responses": [
                "You can contact the college at 123456789.",
                "You can contact the college at 123456789."
            ],
            "context_set": ""
        },
        {
            "tag": "courses",
            "patterns": [
                "What courses are offered in the college?"
            ],
            "responses": [
                "The college offers courses in B.Sc in CS , IT ,DS ; B.COM , BAF ,BMS."
            ],
            "context_set": ""
        },
        {
            "tag": "fees",
            "patterns": [
                "How much is the college fee?",
                "Tell me about the fees",
                "What are the hostel fees?"
            ],
            "responses": [
                "For detailed fee information, please visit our college website.",
                "For detailed fee information, please visit our college website.",
                "For detailed fee information, please visit our college website."
            ],
            "context_set": ""
        },
        {
            "tag": "location",
            "patterns": [
                "What is the college address?"
            ],
            "responses": [
                "The college is located at 6V4F+FPF, Shyamnarayan Thakur Rd, ठाकुर, Thakur Village, Kandivali East, Mumbai, Maharashtra 400101. You can find the location on Google Maps."
            ],
            "context_set": ""
        },
        {
            "tag": "hostel",
            "patterns": [
                "Does the college provide hostel facilities?"
            ],
            "responses": [
                "For detailed information about the hostel, please visit our college website."
            ],
            "context_set": ""
        },
        {
            "tag": "events",
            "patterns": [
                "What events are organized in the college?"
            ],
            "responses": [
                "For information about the events, please visit our college website."
            ],
            "context_set": ""
        },
        {
            "tag": "admission",
            "patterns": [
                "What is the admission process?"
            ],
            "responses": [
                "For detailed admission information, please visit our college website."
            ],
            "context_set": ""
        },
        {
            "tag": "library",
            "patterns": [
                "Does the college have a library?",
                "Where is the library located?"
            ],
            "responses": [
                "Yes",
                "The library is located at 5th Floor of TCSC Building. The timings are from 9am to 5pm, Monday to Friday."
            ],
            "context_set": ""
        },
        {
            "tag": "placement",
            "patterns": [
                "How are the placements in the college?",
                "What is the placement record?"
            ],
            "responses": [
                "The college has a good placement record. Many reputed companies visit our campus for recruitment.",
                "1000 student placed every year"
            ],
            "context_set": ""
        },
        {
            "tag": "name",
            "patterns": [
                "What is College Name ?"
            ],
            "responses": [
                "Thakur College of Science and Commerce."
            ],
            "context_set": ""
        },
        {
            "tag": "happiness",
            "patterns": [
                "Are you happy here?",
                "Do you enjoy being at this college?"
            ],
            "responses": [
                "yes",
                "As an AI, I don't have emotions, but I'm here to assist and provide information about the college."
            ],
            "context_set": ""
        },
        {
            "tag": "complaints",
            "patterns": [
                "What's your #1 complaint about your school?",
                "What do you think needs improvement in your college?"
            ],
            "responses": [
                "yes",
                "While my purpose is to provide information, some students may have different opinions. It's always good to provide feedback for continuous improvement."
            ],
            "context_set": ""
        },
        {
            "tag": "campus_facilities",
            "patterns": [
                "What are the facilities like (science labs, libraries, theaters, gyms, etc.)?",
                "Are the campus facilities well-maintained?",
                "Does the college have modern facilities?"
            ],
            "responses": [
                "yes",
                "yes",
                "Our college prides itself on maintaining well-equipped facilities to support students' academic and extracurricular activities. This includes modern science labs, libraries with extensive resources, theaters, and well-equipped gyms."
            ],
            "context_set": ""
        },
        {
            "tag": "computer_labs",
            "patterns": [
                "Are there enough computer labs?",
                "How accessible are the computer labs?",
                "Is there a shortage of computer lab facilities?"
            ],
            "responses": [
                "yes",
                "yes",
                "Our college provides an ample number of computer labs across campus. These labs are accessible to students and equipped with the necessary technology and software needed for academic work."
            ],
            "context_set": ""
        },
        {
            "tag": "campus_wifi",
            "patterns": [
                "Are there any connectivity issues with the WiFi?"
            ],
            "responses": [
                "The campus WiFi network is designed to provide reliable internet connectivity to students, faculty, and staff. However, occasional connectivity issues may arise, which are usually promptly addressed by the IT department."
            ],
            "context_set": ""
        },
        {
            "tag": "sports_popularity",
            "patterns": [
                "Are sports popular?",
                "Do many students participate in sports?",
                "What's the athletic culture like at your college?"
            ],
            "responses": [
                "yes",
                "yes",
                "Sports are popular at our college, and many students participate in various athletic activities. We have a range of sports teams, intramural sports, and fitness programs to cater to different interests and skill levels."
            ],
            "context_set": ""
        },
        {
            "tag": "fellow_students",
            "patterns": [
                "How would you describe your fellow students?",
                "What are the students like?",
                "Is there a sense of community among students?"
            ],
            "responses": [
                "yes",
                "yes",
                "The student body is diverse and inclusive, with individuals from various backgrounds, interests, and experiences. Students generally foster a sense of community and support each other's academic and personal growth."
            ],
            "context_set": ""
        },
        {
            "tag": "friendly_students",
            "patterns": [
                "Are the students here friendly?",
                "Is it easy to make friends?",
                "Do students interact with each other?"
            ],
            "responses": [
                "yes",
                "yes",
                "Yes, the students here are generally friendly and welcoming. The college environment provides ample opportunities to meet new people, make friends, and form meaningful connections both inside and outside the classroom."
            ],
            "context_set": ""
        },
        {
            "tag": "student_body_unique",
            "patterns": [
                "What makes the student body unique?",
                "Is there anything special about the student population?",
                "What sets the students apart at your college?"
            ],
            "responses": [
                "yes",
                "yes",
                "The student body at our college is unique in its diversity of backgrounds, perspectives, talents, and passions. This diversity fosters a rich learning environment and encourages students to embrace different cultures and viewpoints."
            ],
            "context_set": ""
        },
        {
            "tag": "campus_diversity",
            "patterns": [
                "Is there diversity on campus?",
                "Are there students from different cultural backgrounds?",
                "Does the college promote diversity and inclusion?"
            ],
            "responses": [
                "yes",
                "yes",
                "Yes, our college values diversity and strives to create an inclusive campus community. Students from different cultural backgrounds, ethnicities, and countries contribute to the diverse fabric of our college community."
            ],
            "context_set": ""
        },
        {
            "tag": "international_students",
            "patterns": [
                "Are there many students from other countries?",
                "Do you have a significant international student population?",
                "How diverse is the international representation at your college?"
            ],
            "responses": [
                "yes",
                "yes",
                "Our college welcomes students from around the world, and we have a diverse international student population. International students contribute to the cultural exchange and global perspectives within the college community."
            ],
            "context_set": ""
        },
        {
            "tag": "interactions_among_students",
            "patterns": [
                "Do students of different races and classes interact easily?",
                "Is there interaction and socialization among diverse groups?",
                "Do students embrace diversity and engage in cross-cultural interactions?"
            ],
            "responses": [
                "yes",
                "yes",
                "Students at our college have opportunities to interact and socialize with peers from different races, classes, and cultural backgrounds. The college promotes a welcoming and inclusive environment that encourages cross-cultural interactions and understanding."
            ],
            "context_set": ""
        },
        {
            "tag": "student_cliques",
            "patterns": [
                "Are students cliquish?",
                "Is there a presence of cliques on campus?",
                "Do students segregate into exclusive groups?"
            ],
            "responses": [
                "yes",
                "yes",
                "While some social groups may naturally form based on shared interests and affiliations, our college encourages inclusivity and fosters an environment where students from different backgrounds can mingle and form connections beyond cliques."
            ],
            "context_set": ""
        },
        {
            "tag": "internship_opportunities",
            "patterns": [
                "Are internships available? How do you find them?",
                "What internship opportunities are there?",
                "How does the college support students in finding internships?"
            ],
            "responses": [
                "yes",
                "yes",
                "Internship opportunities are available for students, and the college often provides resources and support to help students find and secure internships. The college's career services office and faculty advisors can offer guidance in exploring and applying for internships."
            ],
            "context_set": ""
        },
        {
            "tag": "career_services",
            "patterns": [
                "What services does the career center provide?",
                "How effective is the college's career guidance?"
            ],
            "responses": [
                "yes",
                "Career Services at our college offers various resources and assistance to help students with career exploration, resume building, job search strategies, interview preparation, and more. Many students find the career guidance helpful in their professional development."
            ],
            "context_set": ""
        },
        {
            "tag": "employer_recruitment",
            "patterns": [
                "Do employers recruit students on campus?",
                "Are there career fairs or job fairs?",
                "How does the college connect students with potential employers?"
            ],
            "responses": [
                "yes",
                "program",
                "Employer recruitment is a common practice at many colleges. Career fairs, job fairs, and networking events are organized to connect students with potential employers. The college's career services office often plays a role in facilitating these connections."
            ],
            "context_set": ""
        },
        {
            "tag": "notable_graduates",
            "patterns": [
                "Who are some of the notable graduates from your college?",
                "Can you mention any famous alumni?"
            ],
            "responses": [
                "Our college has a distinguished list of notable graduates and successful alumni in various fields. Some may include renowned professionals, entrepreneurs, artists, scientists, and leaders who have made significant contributions to their respective fields.",
                "amitabh baachan"
            ],
            "context_set": ""
        },
        {
            "tag": "alumni_association",
            "patterns": [
                "How visible is your school's alumni association on campus?",
                "Are there opportunities to connect with alumni?"
            ],
            "responses": [
                "yes",
                "Many colleges have active alumni associations that offer networking opportunities, mentorship programs, and career support for current students. The visibility and engagement of the alumni association can vary, but efforts are often made to connect students with alumni."
            ],
            "context_set": ""
        },
        {
            "tag": "Crowd",
            "patterns": [
                "People",
                "Boys behaviour",
                "Girls behaviour"
            ],
            "responses": [
                "Good",
                "Very energetic",
                "Kind-hearted"
            ],
            "context_set": ""
        },
        {
            "tag": "naac",
            "patterns": [
                "college review by"
            ],
            "responses": [
                "A+"
            ],
            "context_set": ""
        },
        {
            "tag": "ncc",
            "patterns": [
                "where is college ncc unit"
            ],
            "responses": [
                "room no. 201"
            ],
            "context_set": ""
        },
        {
            "tag": "nic",
            "patterns": [
                "nic"
            ],
            "responses": [
                "nic"
            ],
            "context_set": ""
        },
        {
            "tag": "nsa",
            "patterns": [
                "nsa"
            ],
            "responses": [
                "nsa"
            ],
            "context_set": ""
        },
        {
            "tag": "responseto",
            "patterns": [
                "yes"
            ],
            "responses": [
                "contact no. 983737733"
            ],
            "context_set": ""
        },
        {
            "tag": "NCC",
            "patterns": [
                "where is ncc office"
            ],
            "responses": [
                "room 202"
            ]
        },
        {
            "tag": "ncc",
            "patterns": [
                "where is nss"
            ],
            "responses": [
                "room 203"
            ]
        }
    ]
}